app/controllers/events_controller.rb

INSERT INTO "events" ("creator_id", "description", "place", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["creator_id", 1], ["description", "Oui aller"], ["place", "Poitiers"], ["created_at", "2018-05-03 17:57:56.816877"], ["updated_at", "2018-05-03 17:57:56.816877"]]
---
	def create

	event_params = params.require(:event).permit(:description, :place)

 	@event = Event.new(event_params)
    @event.creator_id = current_user.id
    if @event.save

SELECT "events".* FROM "events"
---
	def index
		@event = Event.all