app/controllers/users_controller.rb

	def create

	user_params = params.require(:user).permit(:name)
	@user = User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Michel"], ["created_at", "2018-05-03 15:19:28.991689"], ["updated_at", "2018-05-03 15:19:28.991689"]]

	def show
	@user = User.find(params[:id])

	@event = Event.where(creator_id: params[:id])

	@event_attend = EventAttendee.where(attendee_id: params[:id])
	@event_name = Event.where(id: @event_attend)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."creator_id" = ?  [["creator_id", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" IN (SELECT "event_attendees"."id" FROM "event_attendees" WHERE "event_attendees"."attendee_id" = ?)  [["attendee_id", 1]]